#operator.py

#5.5.1 混合模式运算符
#只是系统决定了用哪一种运算符，不存在混合运算
#整数转换成浮点数，非复数转换为复数

print (1+4.5) #5.5 int --> float
print (4.4+0j +4.4) #(8.8+0j)


#5.5.2 标准类型运算符
print (5.2 == 5.2) #True
print (-719 >= 833) #False
print (5+4j.real >= 2-3j.real) #True 复数只能够比较部分

print (77 > 66 == 66) #True  same as (77 > 66) and ( 66 == 66)
print (0. < -90.4 < 55.3e2 != 3 <181) #False
print (-1 < 1 or 1 < -1) #True

#算术运算符
print (1 / 2) #0.5 现在/已经不是地板除了
print (1.0 / 2.0) #0.5 /就是真正的除法

print (2 // 3) #0 地板除法，整除
print (round(2 / 3)) #1 伪四舍五入

print (1//2) #0
print (1.0//2.0) #0.0 返回浮点数的地板除法
print (-1//2) #比-0.5小的整数是-1

#幂运算
print (3 ** 2) #9
print (-3 ** 2) #-9 优先级高于左侧-
print ((-3) ** 2) #9
print (4.0 ** -1.0)#0.25 优先级低于右侧的 -
print (4 ** (-1)) #0.25

print (30&45)