#cxt_2.py
#题目：企业发放的奖金根据利润提成。
# 利润(I)低于或等于 10 万元时，奖金可提 10%；
# 利润高于 10 万元，低于 20 万元时，低于 10 万元的部分按 10%提成，高于 10 万元的部分，可可提成 7.5%；
# 20 万到 40 万之间时，高于 20 万元的部分，可提成 5%；
# 40 万到 60 万之间时高于40 万元的部分，可提成 3%；
# 60 万到 100 万之间时，高于 60 万元的部分，可提成1.5%，高于100 万元时，超过 100 万元的部分按 1%提成，
# 从键盘输入当月利润 I，求应发放奖金总数？

'''
i = float(input('please input profits'))
if i<=10:
    reward =  i*0.1
elif 10<i<=20:
    reward = 10*0.1+(i-10)*0.75
elif 20<i<=40:
    reward = 10*0.1+10*0.75+(i-20)*0.05
elif 40<i<=60:
    reward = 10*0.1+10*0.75+20*0.05+(i-40)*0.03
elif 60<i<=100:
    reward = 10*0.1+10*0.75+20*0.05+20*0.03+(i-60)*0.015
else:
    reward = 10*0.1+10*0.75+20*0.05+20*0.03+40*0.015+(i-100)*0.01

print (reward)
#else :
    #raise ValueError('please input again')
'''

i = int(input('input input:'))
k = i
bonus = 0
if i >= 100:
    bonus += (i-100)*0.01
    i = 100
if i >= 60:
    bonus += (i-60)*0.015
    i = 60
if i >= 40:
    bonus += (i-40)*0.03
    i = 40
if i>= 20:
    bonus += (i-20)*0.05
    i = 20
if i >= 10:
    bonus += (i-10)*0.075
    i = 10
if i> 0:
    bonus += i*0.1
print (bonus)